---
type: ConduitSizes
namespace: Autodesk.Revit.DB.Electrical
version: 2024
members: 7
tags: [revit-api, class]
---

# ConduitSizes

`Autodesk.Revit.DB.Electrical.ConduitSizes` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Contains | 2017 | `public bool Contains ( double nominalDiameter )` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetBasicIEnumerator | — | `internal virtual IEnumerator GetBasicIEnumerator ()` |
| Method | GetConduitSizesIterator | 2017 | `public ConduitSizeIterator GetConduitSizesIterator ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator < ConduitSize > GetEnumerator ()` |
| Property | Count | 2017 | `public int Count { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |